In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

# Series

In [3]:
s1=pd.Series([3,4,2,5,'six'],index=['a','p','j','m','b']),

In [4]:
s1

(a      3
 p      4
 j      2
 m      5
 b    six
 dtype: object,)

In [5]:
s2=pd.Series(['days','sunday','monday','tuesday','wednesday'],index=['date',1,2,3,4])

In [6]:
s2

date         days
1          sunday
2          monday
3         tuesday
4       wednesday
dtype: object

In [17]:
s3=pd.Series(['months','january','feburary','march','april'],index=['date',1,2,3,4])

In [18]:
s3

date      months
1        january
2       feburary
3          march
4          april
dtype: object

# Data Frame

DETAIL=pd.DataFrame(series,column=[column name])

In [19]:
df1=pd.DataFrame(s2,columns=['days in a weeek'])

In [20]:
df1

     days in a weeek
date            days
1             sunday
2             monday
3            tuesday
4          wednesday

In [21]:
df1['months']=s3

In [22]:
df1

     days in a weeek    months
date            days    months
1             sunday   january
2             monday  feburary
3            tuesday     march
4          wednesday     april

# df2

In [23]:
fruits={'seed':{1:'orange',2:'apple',3:'watermelom'},'seedless':{1:'pineapple',2:'papaya',3:'grapes'}}

In [24]:
fruits

{'seed': {1: 'orange', 2: 'apple', 3: 'watermelom'},
 'seedless': {1: 'pineapple', 2: 'papaya', 3: 'grapes'}}

In [25]:
df2=pd.DataFrame(fruits,columns=['seed','seedless'])

In [26]:
df2

         seed   seedless
1      orange  pineapple
2       apple     papaya
3  watermelom     grapes

In [35]:
classes={"student names":{1:"sheela",2:"priya",3:"maha",4:"meena",5:"jayanthi"},"reg.no":{1:3258,2:2859,3:2864,4:3789,5:6758},"year of study":{1:"first",2:"second",3:"third",4:"fourth",5:"fifth"},"age":{1:18,2:19,3:20,4:21,5:22}}

In [36]:
classes

{'student names': {1: 'sheela',
  2: 'priya',
  3: 'maha',
  4: 'meena',
  5: 'jayanthi'},
 'reg.no': {1: 3258, 2: 2859, 3: 2864, 4: 3789, 5: 6758},
 'year of study': {1: 'first',
  2: 'second',
  3: 'third',
  4: 'fourth',
  5: 'fifth'},
 'age': {1: 18, 2: 19, 3: 20, 4: 21, 5: 22}}

In [39]:
df3=pd.DataFrame(classes,columns=["student names","reg.no","year of study","age"])

In [40]:
df3

  student names  reg.no year of study  age
1        sheela    3258         first   18
2         priya    2859        second   19
3          maha    2864         third   20
4         meena    3789        fourth   21
5      jayanthi    6758         fifth   22

In [44]:
classes=df3["student names"]

In [46]:
classes

1      sheela
2       priya
3        maha
4       meena
5    jayanthi
Name: student names, dtype: object

In [48]:
df3.drop("age",axis=1)

  student names  reg.no year of study
1        sheela    3258         first
2         priya    2859        second
3          maha    2864         third
4         meena    3789        fourth
5      jayanthi    6758         fifth

In [52]:
df3.drop(5,axis=0)

  student names  reg.no year of study  age
1        sheela    3258         first   18
2         priya    2859        second   19
3          maha    2864         third   20
4         meena    3789        fourth   21